package com.yqsh.diningsys.api.enums;

/**
 * 对外接口返回信息定义
 *
 * @author zhshuo create on 2016-12-05 11:06
 */
public enum APIEnumDefine {
    /*系统使用返回信息定义*/

    /**
     * 接口成功返回
     */
    S001("S001","success") ,

    /**
     * 接口没有成功返回
     */
    S002("S002","false"),

    /**
     * 用户不存在
     */
    S003("S003","用户不存在"),

    /**
     * 密码错误
     */
    S004("S004","密码错误"),

    /**
     * 查询的结果为空
     */
    S005("S005","查询的结果为空"),

    /**
     * 拒绝登录，当前登录POS没有执行结班操作
     */
    S006("S006","拒绝登录，当前登录POS没有执行结班操作"),

    /**
     * 参数不合法
     */
    S007("S007","参数不合法"),

    /**
     * 原密码输入错误
     */
    S008("S008","原密码输入错误"),

    /**
     * 数据错误
     */
    S009("S009","数据错误"),

    /**
     * 未找到该用户的登录信息
     */
    S010("S010","未找到该用户的登录信息"),

    /**
     * 当前登录用户存在未结班的班次信息
     */
    S011("S011","当前登录用户存在未结班的班次信息"),

    /**
     * 该营业流水下有转账流水，不能使用退出团队的功能
     */
    S977("S977","该营业流水下有转账流水，不能使用退出团队的功能"),

    /**
     * 该营业流水是转账流水，请使用撤销转账功能
     */
    S978("S978","该营业流水是转账流水，请使用撤销转账功能"),

    /**
     * 该营业流水已经被关账
     */
    S979("S979","该营业流水已经被关账"),

    /**
     * 退出团队失败
     */
    S980("S980","退出团队失败"),

    /**
     * 定额优惠额度超出权限设置额度
     */
    S981("S981","后台未设置或定额优惠额度超出权限设置额度"),

    /**
     * 常规比例优惠超出权限设置额度
     */
    S982("S982","后台未设置或常规比例优惠超出权限设置额度"),

    /**
     * 全单优惠超出权限设置额度
     */
    S983("S983","后台未设置或全单优惠超出权限设置额度"),


    /**
     * 该用户无买单结算的权限
     */
    S984("S984","该用户无买单结算的权限"),

    /**
     * 该营业流水的所属团队只有该营业流水一条数据，拒绝撤销团队
     */
    S985("S985","该营业流水的所属团队只有该营业流水一条数据，拒绝撤销团队"),

    /**
     * 该营业流水已经转账且被结算
     */
    S986("S986","该营业流水已经转账且被结算"),

    /**
     * 该营业流水不是转账流水
     */
    S987("S987","该营业流水不是转账流水"),

    /**
     * 营业流水已经被手工锁定，请先解锁
     */
    S988("S988","营业流水已经被手工锁定，请先解锁"),

    /**
     * 该授权码无权限
     */
    S989("S989","该授权码无权限"),

    /**
     * 该授权码无效
     */
    S990("S990","该授权码无效"),

    /**
     * 该营业流水未进行埋单
     */
    S991("S991","该营业流水未进行埋单"),

    /**
     * 该营业流水已经被锁定
     */
    S992("S992","该营业流水【owNum】的状态为【state】.【content】,不能进行此操作。"),

    /**
     *该营业流水已经被结算锁定
     */
    S993("S993","该营业流水已经被结算锁定"),


    /**
     * 该营业流水已经被手工锁定
     */
    S994("S994","该营业流水已经被手工锁定"),

    /**
     * 该用户所属职务的业务权限已被禁用
     */
    S995("S995","该用户所属职务的业务权限已被禁用"),

    /**
     * 该营业流水已经埋单
     */
    S996("S996","该营业流水已经埋单"),

    /**
     * 该营业流水下无有效品项
     */
    S997("S997","该营业流水下无有效品项"),

    /**
     * 数据不存在
     */
    S998("S998","数据不存在"),

    /**
     * 服务器内部错误
     */
    S999("S999","服务器内部错误"),


    /**
     * 品项检测错误
     */
    S1000("S1000","Msg"),
    
    /**
     * 转账流水不能更改客位
     */
    S1001("S1001","转账流水不能更改客位"),
    /*模块使用返回信息定义*/
    /*
     *模块定义使用M前缀，如客位服务开单操作，使用M0101跟上具体的提示码(M0101001)
     */
    /**
     * 没有该营业流水单号
     */
    M0101001("M0101001","该营业流水不存在"),
    M0101002("M0101002","客位已被占用"),
    M0101003("M0101003","没有设置权限"),
    M0101004("M0101004","没有减少客位人数权限"),
    M0101005("M0101005","金额不能大于押金"),
    M0101006("M0101006","没有押金可退"),
    M0101008("M0101008","没有加单并厨打权限"),
    M0101009("M0101009","没有加单不厨打权限"),
    M0101010("M0101010","没有退单并厨打功能权限"),
    M0101011("M0101011","没有退单不厨打权限"),
    M0101012("M0101012","退单数量超过已点数量"),
    M0101013("M0101013","起菜类别错误"),
    M0101014("M0101014","已经结算的营业单不能更换客位"),
    M0101015("M0101015","已经埋单的营业单不能更换客位"),
    M0101016("M0101016","已经关张的营业单不能更换客位"),
    M0101017("M0101017","不存在此客位"),
    M0101018("M0101018","赠送的菜品超出权限"),
    M0101019("M0101019","退单的菜品超出权限"),
    M0101020("M0101020","营业单不能进行此操作"),
    M0101021("M0101021","卡号不正确"),
    M0101022("M0101022","当前内部留房不允开台、预定，请到后台进行设置"),
    M0101023("M0101023","没有转台品项"),
    M0101024("M0101024","没有加单品项"),

    /**
     * 该营业流水数据不完整
     */
    M0201001("M0201001","该营业流水数据不完整"),

    /**
     * 该营业流水为转账流水，转账流水结算时，主账营业流水也必须参与结算
     */
    M0201002("M0201002","该营业流水为转账流水，转账流水结算时，主账营业流水也必须参与结算"),

    /**
     * 当非转账流水都参参与结算时，转账流水也必须参与结算
     */
    M0201003("M0201003","当非转账流水都参参与结算时，转账流水也必须参与结算"),

    /**
     * 符合结算条件的营业流水数据只有一条
     */
    M0201004("M0201004","符合结算条件的营业流水数据只有一条"),

    /**
     * 符合结算条件的营业流水数据只有一条
     */
    M0201005("M0201005","符合结算条件的营业流水数据存在多条"),

    /**
     * 存在无有效品项的营业流水，无法进行埋单，请进行关账操作
     */
    M0201006("M0201006","存在无有效品项的营业流水，无法进行埋单，请进行关账操作"),

    /**
     * 存在无有效品项的营业流水，无法进行结算，请进行关账操作
     */
    M0201007("M0201007","存在无有效品项的营业流水，无法进行结算，请进行关账操作"),

    /**
     * 常规比例优惠超出权限设置
     */
    M0201008("M0201008","常规比例优惠超出权限设置"),

    /**
     * 全单比例优惠超出权限设置
     */
    M0201009("M0201009","全单比例优惠超出权限设置"),

    /**
     * 没有支付方式数据
     */
    M0201010("M0201010","没有支付方式数据"),

    /**
     * 支付金额不正确
     */
    M0201011("M0201011","支付金额不正确"),

    /**
     * 找零金额不允许为负
     */
    M0201013("M0201013","找零金额不允许为负"),

    /**
     * 会员系统异常
     */
    M0201014("M0201014","会员系统异常"),

    /**
     * 会员支付不允许混合支付
     */
    M0201015("M0201015","会员支付不允许混合支付"),


    /**
     * 结算失败
     */
    M0201016("M0201016","结算失败"),

    /**
     * 微信以及支付宝只能单独支付
     */
    M0201017("M0201017","微信以及支付宝只能单独支付"),

    /**
     * 该营业流水非转账流水
     */
    M0201012("M0201012","该营业流水非转账流水，不能进行转出操作"),

    /**
     * 结算的营业流水中有押金未处理，请先处理押金
     */
    M0201018("M0201018","结算的营业流水中有押金未处理，请先处理押金"),


    /**
     * 结算的营业流水中存在已经被结算的流水，请重新操作
     */
    M0201019("M0201019","结算的营业流水中存在已经被结算的流水，请重新操作"),

    /**
     * 该用户无变价权限
     */
    M0201020("M0201020","该用户无变价权限"),

    /**
     * 该用户无赠送权限
     */
    M02010201("M0201021","该用户无赠送权限"),
    
    
    /**
     * 该选择会员
     */
    M0201022("M0201022","该选择会员"),

    
    /**
     * 请选择会员支付
     */
    M0201023("M0201023","请选择会员支付"),
    
    /**
     * 密码错误
     */
    M02010202("M02010202","密码错误"),

    /**
     * 该员工无转账权限
     */
    M0202001("M0202001","该员工无转账权限"),

    /**
     * 该营业流水号无可结算的品项
     */
    M0202002("M0202002","该营业流水号无有效品项"),

    /**
     * 该营业流水已经进行埋单操作
     */
    M0202003("M0202003","该营业流水已经进行埋单"),

    /**
     * 转账流水不能和目标流水相同
     */
    M0202004("M0202004","转账流水不能和目标流水相同"),

    /**
     * 该营业流水已经存在转账流水，拒绝转账服务
     */
    M0202005("M0202005","该营业流水已经存在转账流水，拒绝转账服务"),

    /**
     * 该客位有多条营业流水记录
     */
    M0202006("M0202006","该客位有多条营业流水记录"),

    /**
     * 该客位仅有一条营业流水记录
     */
    M0202007("M0202007","该客位仅有一条营业流水记录"),

    /**
     * 该客位仅有一条营业流水记录
     */
    M0202008("M0202008","该用户无拆账权限"),

    /**
     * 该客位无有效的结算流水
     */
    M0202009("M0202009","该客位无有效的结算流水"),

    /**
     * 该用户无结班权限
     */
    M0202010("M0202010","该用户无结班权限"),

    /**
     * 传入的数据长度为0
     */
    M0202013("M0202013","传入的数据长度为0"),

    /**
     * 传入的数据长度为0
     */
    M0202014("M0202014","需要转账的营业流水下无有效品项，拒绝转账"),

    /**
     * 没有跑单权限
     */
    M0202015("M0202015","没有跑单权限"),

    /**
     * 没有撤销埋单权限
     */
    M0202016("M0202016","没有撤销埋单权限"),

    /*关账*/
    /**
     * 当前营业流水不允许关账。团队中有转账的营业流水，需要由当前营业流水进行结算
     */
    M0207001("M0207001","当前营业流水不允许关账。团队中有转账的营业流水，需要由当前营业流水进行结算。"),
    
    /**
     * 当前营业流水有未结清品项，不能进行关账操作。请使用【结算】功能
     */
    M0207002("M0207002","当前营业流水有未结清品项，不能进行关账操作。请使用【结算】功能。"),
    
    /**
     * 当前营业流水有押金未退，不能进行关账操作。请使用【退押金】功能
     */
    M0207003("M0207003","当前营业流水有押金未退，不能进行关账操作。请使用【退押金】功能。"),
    
    /**
     * 无效的待转账流水
     */
    M0202011("M0202011","无效的待转账流水"),

    /**
     * 无效的转账目标流水
     */
    M0202012("M0202012","无效的转账目标流水"),

    /*更换修改*/
    M0303001("M0303001","该桌位存在自增品项,是否同时减少自增品项"),
    /**
     * 该用户无更改人数的权限
     */
    M0404001("M0404001","该用户无更改人数的权限"),

    /**
     * 该用户无减少人数的权限
     */
    M0404002("M0404002","该用户无减少人数的权限"),

    /**
     * 已经结算的营业单不能修改人数
     */
    M0404003("M0404003","已经结算的营业单不能修改人数"),

    /**
     * 已经埋单的营业单不能修改人数
     */
    M0404004("M0404004","已经埋单的营业单不能修改人数"),

    /**
     * 该客座不是清扫状态，无法进行状态修改
     */
    M0405001("M0405001","该客座不是清扫状态，无法进行状态修改"),

    /**
     * 该营业流水为埋单状态，不能更换服务员/营销员
     */
    M0406001("M0406001","该营业流水为埋单状态，不能更换服务员/营销员"),

    /**
     * 没有选择新服务员，不能替换点单数据
     */
    M0406002("M0406002","没有选择新服务员，不能替换点单数据"),

    /**
     * 新服务员ID、新营销员ID以及是否替换为
     */
    M0406003("M0406003","新服务员ID、新营销员ID以及是否替换为空"),

    /**
     * 该营业流水为埋单，不能进行品项变价操作
     */
    M0407001("M0407001","该营业流水为埋单，不能进行品项变价操作"),

    /**
     * 该用户无单品转台的操作权限
     */
    M0411001("M0411001","该用户无单品转台的操作权限"),

    /**
     * 单品转台的营业流水号码不能与目标流水相同
     */
    M0411002("M0411002","单品转台的营业流水号码不能与目标流水相同"),

    /**
     * 该用户无解锁的操作权限
     */
    M0418001("M0418001","该用户无解锁的操作权限"),

    /**
     * 该用户无撤销埋单操作权限
     */
    M0420001("M0420001","该用户无撤销埋单操作权限"),
    
    /**
     * 该用户没有加入团队权限
     */
    M0430001("M0430001","该用户无加入团队的权限"),
    
    /**
     * 该用户没有加入团队权限
     */
    M0430002("M0430002","该营业单已有团队"),
    
    /**
     * 该用户没有加入团队权限
     */
    M0440001("M0440001","该用户无品项沽清/限量的权限"),
    
     /**
     * 当前营业单所对应的座位没有包房消费方案,不能修改
     */
    M0500001("M0500001","当前营业单所对应的座位没有包房消费方案,不能修改"),
      
    /**
    * 网络访问异常
    */
    M0600001("M0600001","网络访问异常"),
    
    /**
    * 授权卡无效
    */
    M0700001("M0700001","授权卡无效"),
    
    /**
    * 授权卡为空
    */
    M0700002("M0700001","授权卡为空"),
    
    /**
    * 授权卡对应用户没有打折权限
    */
    M0700003("M0700001","授权卡对应用户没有打折权限"),

   //支付相关
    /**
     * 请传入支付类型
     */
	P01001("P01001","请传入支付类型"),
	/**
	 * 传入的金额不合法
	 */
	P01002("P01002","请传入合法的金额"),
	/**
	 * 验证组织机构id是否有传
	 */
	P01003("P01003","请传入组织编号"),
	/**
	 * 商户信息与组织未绑定
	 */
	P01004("P01004","未获取到商户信息"),
	/**
	 * 与第三方流水写入失败
	 */
	P01005("P01005","支付流水写入失败"),
	/**
	 * 不支持传入的参数值类型
	 */
	P01006("P01006","支付类型值错误,请根据规范传值"),
	/**
	 * 支付失败
	 */
	P01007("P01007","支付失败!"),
	/**
	 * 店内支付对账时结算流水号
	 */
	P01008("P01008","请传入结算流水号"),
	/**
	 * 未查到相关支付流水
	 */
	P01009("P01009","未查到相关支付流水"),
	/**
	 * 对账失败
	 */
	P01010("P01010","对账失败"),
	/**
	 * 商户信息获取失败
	 */
	P01011("P01011","商户信息获取失败"),
	/**
	 * 订单未支付成功
	 */
	P01012("P01012","订单未支付成功"),
	/**
	 * 请选择失败的数据对账
	 */
	P01013("P01013","请选择失败的数据对账"),

    
	/**
	 * 卡券信息
	 */
    P02001("P02001","获取卡券信息失败"),
    P02002("P02002","没有找到对应的卡券信息"),
    P02003("P02003","优惠券已过期"),
    P02004("P02004","优惠券已使用"),
    P02005("P02005","已加入此券"),
    P02006("P02006","只能使用一种类型的券(打折券/现金券/菜品券)"),
    P02007("P02007","打折券只能使用一张"),
    P02008("P02008","已使用微信优惠券,不能进行比例/全单优惠");

    private String code;

    private String value;


    APIEnumDefine(String code, String value) {
        this.code = code;
        this.value = value;
    }

    public static String enumValue(String code){
        for(APIEnumDefine apiEnumDefine:APIEnumDefine.values()){
            if(apiEnumDefine.code.equals(code)){
                return apiEnumDefine.value;
            }
        }
        return null;
    }
}
